package shared

object Regex {
  val gradeAllR = """비고\s*((?:20\d\d - \d\s*(?:(?:.*?)\s+(?:[A-Z0-9]{6})\s+(?:.*?)\s+\((?:.*)\)\s*(?:.*?)\s+(?:\d)\s+(?:(?:[A-DF][0+]?)|(?:PASS)|(?:FAIL))\s+(?:재)?\s*(?:(?:여름)|(?:겨울))?\s*)+)*)조회합계\s*([0-9\.]+)""".r.unanchored

  val totR = """조회합계\s*([0-9\.]+)""".r.unanchored

  val semesterR = """((?:(20\d\d) - (\d)\s*(?:(?:.*?)\s+(?:[A-Z0-9]{6})\s+(?:.*?)\s+\((?:.*)\)\s*(?:.*?)\s+(?:\d)\s+(?:(?:[A-DF][0+]?)|(?:PASS)|(?:FAIL))\s+(?:재)?\s*(?:(?:여름)|(?:겨울))?\s*)+))""".r.unanchored

  val gradeR = """(?:(.*?)\s+([A-Z0-9]{6})\s+(.*?)\s+\((.*)\)\s*(.*?)\s+(\d)\s+((?:[A-DF][0+]?)|(?:PASS)|(?:FAIL))\s+(재)?\s*((?:여름)|(?:겨울))?\s*)""".r.unanchored
}
